Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In 2.x, all use cases now extend `GroupedObservable` directly thus the factory methods are no longer available; the whole class is now abstract.
zh_cn: 在 2.x 中，所有用例现在都直接继承了 `GroupedObservable`，因此工厂方法不再可用；整个类现在都是抽象的。

source: In AEAD encryption, the plaintext is simultaneously encrypted and integrity protected.
zh_cn: 在 AEAD 加密中，明文同时被加密并受到完整性保护。

source: In DSA, the 20 bytes of the SHA-1 hash are run directly through the Digital Signing Algorithm with no additional hashing.
zh_cn: 在 DSA 中，SHA-1 散列的 20 个字节直接通过数字签名算法运行，无需额外的散列。

source: In HTTP's case, Transfer-Encoding is primarily intended to accurately delimit a dynamically generated payload and to distinguish payload encodings that are only applied for transport efficiency or security from those that are characteristics of the selected resource.
zh_cn: 在 HTTP 的情况下，Transfer-Encoding 主要用于准确地界定动态生成的有效载荷，并区分仅用于传输效率或安全性，作为所选资源的特征的有效载荷编码。

source: In HTTP, the only unsafe characteristic of message-bodies is the difficulty in determining the exact body length (section 7.2.2), or the desire to encrypt data over a shared transport.
zh_cn: 在 HTTP 中，消息体的唯一不安全特征是难以确定确切的主体长度(第 7.2.2 节)，或者希望通过共享传输加密数据。

source: In HTTP/1.0, most implementations used a new connection for each request/response exchange.
zh_cn: 在 HTTP/1.0 中，大多数实现为每个请求/响应交换使用了新连接。

source: In HTTP/1.1, a connection may be used for one or more request/response exchanges, although connections may be closed for a variety of reasons (see section 8.1).
zh_cn: 在 HTTP/1.1 中，连接可以用于一个或多个请求/响应交换，尽管由于各种原因可能会关闭连接(请参阅第 8.1 节)。

source: In RSA signing, the opaque vector contains the signature generated using the RSASSA-PKCS1-v1_5 signature scheme defined in [PKCS1].
zh_cn: 在 RSA 签名中，不透明 vector 包含使用 [PKCS1] 中定义的 RSASSA-PKCS1-v1_5 签名方案生成的签名。

source: In ReactiveX an observer subscribes to an Observable.
zh_cn: 在 ReactiveX 中，一个observer (观察者) subscribes (订阅) 一个 Observable (可观察对象)。

source: In ReactiveX, however, they name the event handlers themselves.
zh_cn: 但是，在 ReactiveX 中，它们是事件处理程序的名字。

source: In RxJava 1.x, the interface `rx.Subscription` was responsible for stream and resource lifecycle management, namely unsubscribing a sequence and releasing general resources such as scheduled tasks.
zh_cn: 在 RxJava 1.x 中，接口 `rx.Subscription` 负责流和资源生命周期管理，即取消订阅序列并释放一般资源(如计划任务)。

source: In RxJava the default `Scheduler`s run on daemon threads, which means once the Java main thread exits, they all get stopped and background computations may never happen.
zh_cn: 在 RxJava 中，默认的 `Scheduler` 在守护线程上运行，这意味着一旦 Java 主线程退出，它们都会被停止并且后台计算可能永远不会发生。

source: In RxJava's documentation, **emission**, **emits**, **item**, **event**, **signal**, **data** and **message** are considered synonyms and represent the object traveling along the dataflow.
zh_cn: 在 RxJava 的文档中，**emission**, **emits**, **item**, **event**, **signal**, **data** and **message** 被视为同义词并代表沿数据流传播的对象。

source: In RxJava, the dedicated `Flowable` class is designated to support backpressure and `Observable` is dedicated for the non-backpressured operations (short sequences, GUI interactions, etc.).
zh_cn: 在 RxJava 中，专用的“Flowable”类被指定为支持背压，而“Observable”专用于非背压操作(短序列，GUI 交互等)。

source: In TLS 1.2 and below, the server replies with an empty extension to indicate negotiation of this extension and the OCSP information is carried in a CertificateStatus message.
zh_cn: 在 TLS 1.2 及更低版本中，服务器回复空的扩展以指示此扩展的协商，并且 OCSP 信息在 CertificateStatus 消息中携带。

source: In TLS 1.2 and below, this functionality was provided by "session IDs" and "session tickets" [RFC5077].
zh_cn: 在 TLS 1.2 及更低版本中，此功能由“session IDs”和“session tickets”[RFC 5077] 提供。

source: In TLS 1.2, RSASSA-PSS is used with RSA cipher suites.
zh_cn: 在 TLS 1.2 中，RSASSA-PSS 与 RSA 密码套件一起使用。

source: In TLS 1.2, this functionality has been obsoleted by the supported_signature_algorithms, and the certificate type no longer restricts the algorithm used to sign the certificate.
zh_cn: 在 TLS 1.2 中，supported_signature_algorithms 已废弃此功能，并且证书类型不再限制用于签署证书的算法。

source: In TLS 1.3 as defined by this document, either a PSK or a certificate is always used, but not both.
zh_cn: 在本文档定义的 TLS 1.3 中，始终使用 PSK 或证书，但不能同时使用两者。

source: In TLS 1.3, as opposed to previous versions of TLS, all ciphers are modeled as "Authenticated Encryption with Associated Data" (AEAD) [RFC5116].
zh_cn: 在 TLS 1.3 中，与先前版本的 TLS 相反，所有密码都被建模为“具有关联数据的认证加密”(AEAD)[RFC5116]。

source: In TLS 1.3, it is the size of the HMAC output for the Hash used for the handshake.
zh_cn: 在 TLS 1.3 中，它是用于握手的哈希的 HMAC 输出的大小。

source: In TLS 1.3, the TLS server indicates its version using the "supported_versions" extension (Section 4.2.1), and the legacy_version field MUST be set to 0x0303, which is the version number for TLS 1.2.
zh_cn: 在 TLS 1.3 中，TLS 服务器使用“supported_versions”扩展(第 4.2.1 节)指示其版本，并且 legacy_version 字段必须设置为 0x0303，这是 TLS 1.2 的版本号。

source: In TLS 1.3, the client indicates its version preferences in the "supported_versions" extension (Section 4.2.1) and the legacy_version field MUST be set to 0x0303, which is the version number for TLS 1.2.
zh_cn: 在 TLS 1.3 中，客户端在“supported_versions”扩展(第 4.2.1 节)中指示其版本首选项，并且 legacy_version 字段必须设置为 0x0303，这是 TLS 1.2 的版本号。

source: In TLS 1.3, the former is expressed by sending the "signature_algorithms" and optionally "signature_algorithms_cert" extensions.
zh_cn: 在 TLS 1.3 中，前者通过发送“signature_algorithms”和可选的“signature_algorithms_cert”扩展来表示。

source: In TLS 1.3, the server's OCSP information is carried in an extension in the CertificateEntry containing the associated certificate.
zh_cn: 在 TLS 1.3 中，服务器的 OCSP 信息在包含相关证书的 CertificateEntry 中的扩展中携带。

source: In TLS 1.3, the server's SCT information is carried in an extension in the CertificateEntry.
zh_cn: 在 TLS 1.3 中，服务器的 SCT 信息在 CertificateEntry 的扩展中携带。

source: In TLS 1.3, the use of certain extensions is mandatory, as functionality has moved into extensions to preserve ClientHello compatibility with previous versions of TLS.
zh_cn: 在 TLS 1.3 中，必须使用某些扩展，因为功能已转移到扩展中以保持 ClientHello 与先前版本的 TLS 的兼容性。

source: In TLS 1.3, unlike TLS 1.2, extensions are negotiated for each handshake even when in resumption-PSK mode.
zh_cn: 在 TLS 1.3 中，与 TLS 1.2 不同，即使处于恢复-PSK 模式，也会针对每次握手协商扩展。

source: In TLS, the cryptographic negotiation proceeds by the client offering the following four sets of options in its ClientHello:
zh_cn: 在 TLS 中，加密协商由客户端在其 ClientHello 中提供以下四组选项来进行：

source: In `range`'s terms, it will remember that there was a `request(1)` call while it called `onNext()` and once `onNext()` returns, it will make another round and call `onNext()` with the next integer value.
zh_cn: 在 `range` 的术语中，它会记住在调用 `onNext()` 时有一个 `request(1)` 调用，一旦 `onNext()` 返回，它将进行另一轮，调用指定整数次数的 `onNext()`。

source: In a 0-RTT exchange,
zh_cn: 在 0-RTT 交换中，

source: In a HelloRetryRequest message, the "extension_data" field of this extension contains a KeyShareHelloRetryRequest value:
zh_cn: 在 HelloRetryRequest 消息中，此扩展的“extension_data”字段包含 KeyShareHelloRetryRequest 值：

source: In a ServerHello message, the "extension_data" field of this extension contains a KeyShareServerHello value:
zh_cn: 在 ServerHello 消息中，此扩展的“extension_data”字段包含 KeyShareServerHello 值：

source: In a later section, more detail is offered with respect to the reaction of the TCP to events.
zh_cn: 在后面的部分中，提供了有关 TCP 对事件的反应的更多细节。

source: In a naive implementation of `range`, such call would recursively call `onNext`, leading to `StackOverflowError` which is of course undesirable.
zh_cn: 在 `range` 的简单实现中，这样的调用将递归调用 `onNext`，导致 `StackOverflowError`，这当然是不可取的。

source: In a response to a HEAD request, the representation header fields describe the representation data that would have been enclosed in the payload body if the same request had been a GET.
zh_cn: 在对 HEAD 请求的响应中，表示首部字段描述了如果相同的请求是 GET 则将包含在有效载荷主体中的表示数据。

source: In a response, the payload's purpose is defined by both the request method and the response status code.
zh_cn: 在响应中，有效载荷的目的由请求方法和响应状态代码定义。

source: In addition several variables relating to the send and receive sequence numbers are stored in the TCB.
zh_cn: 另外，与发送和接收序列号有关的几个变量存储在 TCB 中。

source: In addition to aiding the readability of such identifiers through the consistent use of familiar syntax, this uniform representation of hierarchy across naming schemes allows scheme-independent references to be made relative to that hierarchy.
zh_cn: 除了通过一致使用熟悉的语法来帮助这些标识符的可读性之外，这种跨命名方案的层次结构的统一表示允许相对于该层次结构进行与方案无关的引用。

source: In addition, `org.reactivestreams.Subscriber` has no notion of adding resources to it, cancelling it or requesting from the outside.
zh_cn: 此外，`org.reactivestreams.Subscriber` 没有向其添加资源，取消或从外部请求的概念。

source: In addition, a URI reference (Section 4.1) may be a relative-path reference, in which case the first path segment cannot contain a colon (":") character.
zh_cn: 此外，URI 引用(第 4.1 节)可以是相对路径引用，在这种情况下，第一个路径段不能包含冒号(“:”)字符。

source: In addition, a construction is required to do expansion of secrets into blocks of data for the purposes of key generation or validation.
zh_cn: 此外，为了密钥生成或验证的目的，需要一个构造（译注：函数）将机密扩展为数据块。

source: In addition, future revisions of [PKIX] may specify mechanisms for certificates to indicate which digest algorithms are to be used with DSA.
zh_cn: 此外，[PKIX] 的未来版本可以指定证书的机制，以指示哪些摘要算法将与 DSA 一起使用。

source: In addition, if the text is represented in a character set that does not use octets 13 and 10 for CR and LF respectively, as is the case for some multi-byte character sets, HTTP allows the use of whatever octet sequences are defined by that character set to represent the equivalent of CR and LF for line breaks.
zh_cn: 此外，如果文本以不分别对 CR 和 LF 使用八位字节 13 和 10 的字符集表示，就像某些多字节字符集的情况一样，HTTP 允许使用由此定义的任何八位字节序列。字符集表示换行符的 CR 和 LF 的等效值。

source: In addition, if the wrapped API supports cancellation (such as the listener removal in the example), one can use the `setCancellation` (or `setSubscription` for `Subscription`-like resources) to register a cancellation callback that gets invoked when the downstream unsubscribes or the `onError`/`onComplete` is called on the provided `Emitter`instance.
zh_cn: 此外，如果包装的 API 支持取消(例如示例中的侦听器删除)，则可以使用 `setCancellation`(或 `setSubscription` 用于类似 Subscription` 的资源)，来注册在下游取消订阅或在提供的 `Emitter` 实例上调用 `onError`/`onComplete` 时调用的取消回调。

source: In addition, in its updated ClientHello, the client SHOULD NOT offer any pre-shared keys associated with a hash other than that of the selected cipher suite.
zh_cn: 此外，在其更新的 ClientHello 中，客户端不应提供与除选定密码套件之外的散列相关联的任何预共享密钥。

source: In addition, it MUST verify that the following values are the same as those associated with the selected PSK:
zh_cn: 此外，它必须验证以下值与所选 PSK 相关的值是否相同：

source: In addition, it allows a user agent to apply appropriate constraints on the automated use of unsafe methods when processing potentially untrusted content.
zh_cn: 此外，它允许用户代理在处理可能不受信任的内容时对自动使用不安全方法应用适当的约束。

source: In addition, operators requiring a predicate no longer use `Func1<T, Boolean>` but have a separate, primitive-returning type of `Predicate<T>` (allows better inlining due to no autoboxing).
zh_cn: 另外，需要谓词的运算符不再使用 `Func1<T, Boolean>`，但是有一个单独的，原始返回类型的 `Predicate<T>`(由于没有自动装箱，允许更好的内联)。

source: In addition, some 3rd party libraries/code throw when they get interrupted by a cancel/dispose call which leads to an undeliverable exception most of the time.
zh_cn: 此外，一些第三方库/代码在被取消/dispose 调用中断时抛出，这导致大多数时间无法传递的异常。

source: In addition, the hash and signature algorithms MUST be compatible with the key in the client's end-entity certificate.
zh_cn: 此外，哈希和签名算法必须与客户端的最终实体证书中的密钥兼容。

source: In addition, the hash and signature algorithms MUST be compatible with the key in the server's end-entity certificate.
zh_cn: 此外，散列和签名算法必须与服务器的终端实体证书中的密钥兼容。

source: In addition, the parameters for these algorithms are known: the MAC key and the bulk encryption keys for the connection in both the read and the write directions.
zh_cn: 此外，这些算法的参数是已知的：MAC 密钥和用于读取和写入方向的连接的批量加密密钥。

source: In addition, the proliferation of incompletely-implemented applications calling themselves "HTTP/1.0" has necessitated a protocol version change in order for two communicating applications to determine each other's true capabilities.
zh_cn: 此外，自称为“HTTP/1.0”的不完全实现的应用程序的激增使得必须进行协议版本更改，以便两个通信应用程序确定彼此的真实能力。

source: In addition, the signature algorithm MUST be compatible with the key in the sender's end-entity certificate.
zh_cn: 此外，签名算法必须与发送者的终端实体证书中的密钥兼容。

source: In addition, there is option to wrap an existing `Executor` (and its subtypes such as `ExecutorService`) into a `Scheduler` via `Schedulers.from(Executor)`.
zh_cn: 此外，还可以选择通过 `Schedulers.from(Executor)` 将现有的 `Executor`(及其子类型，如 `ExecutorService`) 包装到 `Scheduler` 中。

source: In addition, they won't signal `BufferOverflowException`.
zh_cn: 另外，它们不会发出 `BufferOverflowException` 信号。

source: In all handshakes, the server MUST send the EncryptedExtensions message immediately after the ServerHello message.
zh_cn: 在所有握手中，服务器必须在 ServerHello 消息之后立即发送 EncryptedExtensions 消息。

source: In all other cases, an HTTP user agent SHOULD follow the same or similar behavior as a MIME user agent would upon receipt of a multipart type.
zh_cn: 在所有其他情况下，HTTP 用户代理应该遵循与 MIME 用户代理在收到多部分类型时相同或类似的行为。

source: In all other fields, parentheses are considered part of the field value.
zh_cn: 在所有其他字段中，括号被视为字段值的一部分。

source: In all states except SYN-SENT, all reset (RST) segments are validated by checking their SEQ-fields.
zh_cn: 在除 SYN-SENT 之外的所有状态中，通过检查其 SEQ-字段来验证所有复位(RST)报文段。

source: In an attempt to establish the connection, A's TCP will send a segment containing SYN.
zh_cn: 在尝试建立连接时，A 的 TCP 将发送包含 SYN 的报文段。

source: In an ordinary method call — that is, not the sort of asynchronous, parallel calls typical in ReactiveX — the flow is something like this:
zh_cn: 在一个普通的方法调用中 - 也就是说，非 ReactiveX 中典型的异步并行调用 - 流程是这样的：

source: In anticipation of future, as-yet-undefined IP literal address formats, an implementation may use an optional version flag to indicate such a format explicitly rather than rely on heuristic determination.
zh_cn: 在预期未来，尚未定义的 IP 文字地址格式时，实现可以使用可选的版本标志来明确地指示这种格式而不是依赖于启发式确定。

source: In any case, a TLS server MUST NOT generate an alert if processing an RSA-encrypted premaster secret message fails, or the version number is not as expected.
zh_cn: 在任何情况下，如果处理 RSA 加密的预主密钥消息失败，或者版本号不符合预期，TLS 服务器不得生成警报。

source: In block cipher encryption, every block of plaintext encrypts to a block of ciphertext.
zh_cn: 在分组密码加密中，每个明文块都加密到一个密文块。

source: In case the client does not want to maintain a connection for more than that request, it SHOULD send a Connection header including the connection-token close.
zh_cn: 如果客户端不希望维护一个超过该请求的连接，它应该发送包含连接标记关闭的 Connection 首部。

source: In case the computation itself should be delayed until the downstream actually requests, we can use `just` with `map`:
zh_cn: 如果计算本身应该延迟到下游实际请求时，我们可以使用 `just` 和 `map`：

source: In case the source data can be processed more efficiently in batch, one can reduce the likelihood of `MissingBackpressureException` by using one of the standard batching operators (by size and/or by time).
zh_cn: 如果可以批量处理源数据，则可以通过使用标准批处理操作符(按大小和/或按时间)之一减少 `MissingBackpressureException` 的可能性。

source: In compatibility mode (see Appendix D.4), this field MUST be non-empty, so a client not offering a pre-TLS 1.3 session MUST generate a new 32-byte value.
zh_cn: 在兼容模式下(见附录 D.4)，该字段必须是非空的，因此不提供 TLS 1.3 之前会话的客户端必须生成一个新的 32 字节值。

source: In contrast, a connection-specific header field that is received without a corresponding connection option usually indicates that the field has been improperly forwarded by an intermediary and ought to be ignored by the recipient.
zh_cn: 相反，在没有相应连接选项的情况下接收的特定于连接的首部字段通常表示该字段已被中间设备不正确地转发并且应该被接收者忽略。

source: In contrast, the URI in a PUT request identifies the entity enclosed with the request -- the user agent knows what URI is intended and the server MUST NOT attempt to apply the request to some other resource.
zh_cn: 相反，PUT 请求中的 URI 标识请求附带的实体 - 用户代理知道 URI 的用途，服务器不得尝试将请求应用于其他资源。

source: In effect, this method is similar to the rm command in UNIX: it expresses a deletion operation on the URI mapping of the origin server rather than an expectation that the previously associated information be deleted.
zh_cn: 实际上，此方法类似于 UNIX 中的 rm 命令：它表示对源服务器的 URI 映射执行删除操作，而不是期望删除先前关联的信息。

source: In either case, the length declares the number of bytes, not the number of elements, in the vector.
zh_cn: 在任何一种情况下，长度都声明 vector 中的字节数，而不是元素数。

source: In fact, since version 2.1.10, it doesn't
zh_cn: 事实上，从版本 2.1.10 开始，

source: In fact, that is how many resources are implemented (see Section 9.1 for related security considerations).
zh_cn: 实际上，这就是很多资源的实现(有关相关的安全性考虑，请参见第 9.1 节)。

source: In fact, there are a wide variety of architectures and configurations of caches and proxies currently being experimented with or deployed across the World Wide Web.
zh_cn: 事实上，目前正在万维网上试验或部署各种缓存和代理的体系结构和配置。

source: In figure 12, we find the two TCPs A and B with passive connections waiting for SYN.
zh_cn: 在图 12 中，我们发现两个 TCP A 和 B 具有等待 SYN 的被动连接。

source: In general, HTTP treats a multipart message-body no differently than any other media type: strictly as payload.
zh_cn: 通常，HTTP 处理多部分消息体与任何其他媒体类型没有区别：严格地作为有效载荷。

source: In general, HTTP/TLS requests are generated by dereferencing a URI.
zh_cn: 通常，通过解除引用 URI 来生成 HTTP/TLS 请求。

source: In general, an HTTP user agent SHOULD follow the same or similar behavior as a MIME user agent would upon receipt of a multipart type.
zh_cn: 通常，HTTP 用户代理应该遵循与 MIME 用户代理在收到多部分类型时相同或类似的行为。

source: In general, an intermediary ought to recognize its own server names, including any aliases, local variations, or literal IP addresses, and respond to such requests directly.
zh_cn: 通常，中介应该识别其自己的服务器名称，包括任何别名，本地变体或文字 IP 地址，并直接响应此类请求。

source: In general, detailed certificate validation procedures are out of scope for TLS (see [RFC5280]).
zh_cn: 通常，详细的证书验证程序超出了 TLS 的范围(参见 [RFC5280])。

source: In general, error alerts should be used for the former and a field in the server extension response for the latter.
zh_cn: 通常，错误警报应该用于前者，而服务器扩展响应中的字段应该用于后者。

source: In general, error alerts should be used for the former, and a field in the server extension response for the latter.
zh_cn: 通常，前者应使用错误警报，后者应使用服务器扩展响应中的字段。

source: In general, implementations can implement the transcript by keeping a running transcript hash value based on the negotiated hash.
zh_cn: 通常，实现可以通过基于协商的散列保持运行的 transcript hash 来实现此 transcript。

source: In general, safe methods that do not depend on a current or authoritative response are defined as cacheable; this specification defines GET, HEAD, and POST as cacheable, although the overwhelming majority of cache implementations only support GET and HEAD.
zh_cn: 通常，不依赖于当前或权威响应的安全方法被定义为可缓存的；尽管绝大多数缓存实现仅支持 GET 和 HEAD，但此规范将 GET，HEAD 和 POST 定义为可缓存。

source: In general, the best way to do this is to compute the MAC even if the padding is incorrect, and only then reject the packet.
zh_cn: 通常，执行此操作的最佳方法是即使填充不正确也计算 MAC，然后才拒绝该数据包。

source: In general, the specification of each extension type needs to describe the effect of the extension both during full handshake and session resumption.
zh_cn: 通常，每种扩展类型的规范需要描述在完全握手和会话恢复期间扩展的影响。

source: In line 2 of figure 7, TCP A begins by sending a SYN segment indicating that it will use sequence numbers starting with sequence number 100.
zh_cn: 在图 7 的第 2 行中，TCP A 通过发送 SYN 报文段开始，该 SYN 报文段指示它将使用以序列号 100 开始的序列号。

source: In line 3, TCP B sends a SYN and acknowledges the SYN it received from TCP A. Note that the acknowledgment field indicates TCP B is now expecting to hear sequence 101, acknowledging the SYN which occupied sequence 100.
zh_cn: 在第 3 行中，TCP B 发送 SYN 并确认它从 TCP A 收到的 SYN。注意，确认字段指示 TCP B 现在期望收到序列 101，并确认了占用序列号 100 的 SYN 报文段。

source: In many cases, a user agent is installed or configured to run in the background and save its results for later inspection (or save only a subset of those results that might be interesting or erroneous).
zh_cn: 在许多情况下，安装或配置用户代理以在后台运行并保存其结果以供以后检查(或仅保存可能有趣或错误的那些结果的子集)。

source: In many cases, it is appropriate to use the partially implicit nonce technique described in Section 3.2.1 of [AEAD]; with record_iv_length being the length of the explicit part.
zh_cn: 在许多情况下，使用 [AEAD] 第 3.2.1 节中描述的部分隐式随机数技术是合适的；record_iv_length 是显式部分的长度。

source: In many cases, the host syntax is used only for the sake of reusing the existing registration process created and deployed for DNS, thus obtaining a globally unique name without the cost of deploying another registry.
zh_cn: 在许多情况下，主机语法仅用于重用为 DNS 创建和部署的现有注册过程，从而获得全局唯一名称，而无需部署其他注册表。

source: In many software programming tasks, you more or less expect that the instructions you write will execute and complete incrementally, one-at-a-time, in order as you have written them.
zh_cn: 在许多软件编程任务中，您或多或少地期望您编写的指令将按照您编写的顺序逐个执行并逐步完成。

source: In modern RxJava, most asynchronous operators now have a bounded internal buffer, like `observeOn` above and any attempt to overflow this buffer will terminate the whole sequence with `MissingBackpressureException`.
zh_cn: 在现代的 RxJava 中，大多数异步操作符现在都有一个有界的内部缓冲区，如上面的 `observeOn`，任何溢出此缓冲区的尝试都将带 `MissingBackpressureException` 终止整个序列。

source: In order to accept early data, the server MUST have accepted a PSK cipher suite and selected the first key offered in the client's "pre_shared_key" extension.
zh_cn: 为了接受早期数据，服务器必须接受 PSK 密码套件并选择客户端“pre_shared_key”扩展中提供的第一个密钥。

source: In order to allow extension of the TLS protocol, additional record content types can be supported by the record protocol.
zh_cn: 为了允许扩展 TLS 协议，记录协议可以支持附加的记录内容类型。

source: In order to avoid confusing downstream recipients, a proxy or gateway MUST remove or replace any received connection options before forwarding the message.
zh_cn: 为了避免混淆下游接收者，代理或网关必须在转发消息之前删除或替换任何收到的连接选项。

source: In order to avoid request loops, a proxy MUST be able to recognize all of its server names, including any aliases, local variations, and the numeric IP address.
zh_cn: 为了避免请求循环，代理必须能够识别其所有服务器名称，包括任何别名，本地变体和数字 IP 地址。

source: In order to begin connection protection, the TLS Record Protocol requires specification of a suite of algorithms, a master secret, and the client and server random values.
zh_cn: 为了开始连接保护，TLS 记录协议需要一套规范，包含算法，主密钥，客户端和服务器的随机值。

source: In order to decrypt and verify, the cipher takes as input the key, nonce, additional data, and the AEADEncrypted value.
zh_cn: 为了解密和验证，密码将密钥，随机数，附加数据和 AEADE 加密值作为输入。

source: In order to decrypt and verify, the cipher takes as input the key, nonce, the "additional_data", and the AEADEncrypted value.
zh_cn: 为了解密和验证，加密将密钥，随机数，“additional_data”和 AEADEncrypted 值作为输入。

source: In order to defend against this attack, implementations MUST ensure that record processing time is essentially the same whether or not the padding is correct.
zh_cn: 为了抵御这种攻击，无论填充是否正确，实现必须确保记录处理时间基本相同。

source: In order to disambiguate the syntax, we apply the "first-match-wins" algorithm:
zh_cn: 为了消除语法歧义，我们应用“first-match-wins”算法：

source: In order to help lift these extra overheads, a new method `Flowable.subscribe(FlowableSubscriber<? super T>)` has been added which exposes the original behavior from before 2.0.7.
zh_cn: 为了帮助解除这些额外的开销，添加了一个新的方法 `Flowable.subscribe(FlowableSubscriber<? super T>)`，它暴露了 2.0.7 之前的原始行为。

source: In order to maximize backward compatibility, a record containing an initial ClientHello SHOULD have version 0x0301 (reflecting TLS 1.0) and a record containing a second ClientHello or a ServerHello MUST have version 0x0303 (reflecting TLS 1.2).
zh_cn: 为了最大化向后兼容性，包含初始 ClientHello 的记录应该具有版本 0x0301(反映 TLS 1.0)，包含第二个 ClientHello 或 ServerHello 的记录必须具有版本 0x0303(反映 TLS 1.2)。

source: In order to negotiate correctly, the server MUST check any candidate cipher suites against the "signature_algorithms" extension before selecting them.
zh_cn: 为了正确协商，服务器必须在选择它们之前针对“signature_algorithms”扩展检查任何候选加密套件。
